app/views/comments/_index.html.erb


    <% @pin.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."pin_id" = ?