app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "pin_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @comment = Comment.new(comment_params)
      @comment.user_id = current_user.id
     if @comment.save