app/controllers/pin_attachments_controller.rb

SELECT  "pin_attachments".* FROM "pin_attachments" WHERE "pin_attachments"."id" = ? LIMIT 1  [["id", 20]]
---
    def set_pin_attachment
      @pin_attachment = PinAttachment.find(params[:id])