app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins"  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "pins"
---
  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 8)

SELECT "pin_attachments".* FROM "pin_attachments" WHERE "pin_attachments"."pin_id" = ?  [["pin_id", 27]]
---
  def show
   @pin_attachments = @pin.pin_attachments.all

INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "test user 1"], ["user_id", 1], ["created_at", "2015-03-11 06:24:24.964403"], ["updated_at", "2015-03-11 06:24:24.964403"]]
INSERT INTO "pin_attachments" ("pictures", "pin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pictures", "#<ActionDispatch::Http::UploadedFile:0x007ff254663930>"], ["pin_id", 27], ["created_at", "2015-04-14 03:34:08.889164"], ["updated_at", "2015-04-14 03:34:08.889164"]]
---
  def create
    @pin = current_user.pins.build(pin_params)
        if @pin.save
            params[:pin_attachments]['pictures'].each do |a|
              @pin_attachment = @pin.pin_attachments.create!(:pictures => a, :pin_id => @pin.id)