app/views/layouts/_header.html.erb

SELECT "categories".* FROM "categories"  ORDER BY name ASC
---
                      </li>
                      <% Category.order('name ASC').each do |category| %>